## Docker初步

### Docker是什么？

**Docker 是一个“容器引擎”**，用于将软件及其所有依赖打包成一个“容器”（container），使得程序能**在任何地方一致运行**，包括不同的操作系统或服务器上。

- 容器 ≈ “轻量级虚拟机”

- 容器包括：代码 + 系统库 + 运行环境

- **一次构建，处处运行**

### 基本概念

| 名称                  | 解释                           |
| --------------------- | ------------------------------ |
| **Image（镜像）**     | 容器的模板（类似 ISO）         |
| **Container（容器）** | 镜像运行出来的实例             |
| **Dockerfile**        | 用来构建镜像的脚本             |
| **Volume（卷）**      | 持久化数据（容器删了数据还在） |
| **Docker Hub**        | 官方镜像仓库，类似 GitHub      |

一个镜像可以构建多个容器，镜像是静态的模板，容器是动态的实例，容器可以被创建、运行、停止和删除。

### 常用Docker命令

拉取镜像（**从远程镜像仓库（默认 Docker Hub）下载一个镜像到你本地的 Docker 环境中**）：

```bash
docker pull <镜像名>:<标签>
```

> 标签（`tag`）即为版本，`:<标签>`可省略，省略则默认下载最新版本（`defaut tag: latest`）
>
> 下载后的镜像会存在`/var/lib/docker`目录

查看本地镜像：

```bash
docker images
```

删除镜像：

```bash
docker rmi <镜像ID 或 镜像名称>
```

> | 命令举例                  | 删除对象                                           | 使用方式       | 优点             | 缺点                     |
> | ------------------------- | -------------------------------------------------- | -------------- | ---------------- | ------------------------ |
> | `docker rmi 2f1d13d03e78` | **通过镜像 ID 删除镜像**                           | 精准、不会歧义 | 精确删除指定版本 | 不容易记住，ID 会变      |
> | `docker rmi ubuntu`       | **通过镜像名称删除镜像**（实际是 `ubuntu:latest`） | 更直观、易读   | 方便记忆         | 可能有多个标签、版本冲突 |

创建并运行新容器：

```bash
docker run <选项> <镜像名>
```

> | 选项     | 功能               |
> | -------- | ------------------ |
> | `-it`    | 交互式             |
> | `-d`     | 后台运行           |
> | `--name` | 容器命名           |
> | `-p`     | 端口映射           |
> | `-v`     | 挂载卷             |
> | `rm`     | 容器退出后自动删除 |

创建并以交互式模式运行容器：

```bash
docker run -it ubuntu
```

> | 选项 | 说明                       |
> | ---- | -------------------------- |
> | `-i` | 交互式运行（保持输入）     |
> | `-t` | 分配一个伪终端（terminal） |
>
> 然后会进入一个 Ubuntu shell：
>
> ```ruby
> root@a2d3f4g5h6:/#
> ```
>
> 就相当于一个ubuntu虚拟机，可以在里面进行各种ubuntu的操作

在创建时给容器命名：

```bash
docker run --name <容器名> <镜像名>
```

> 如果创建时不给容器命名，Docker会自动给容器起一个“形容词_人名”格式的随机名字，例如`stoic_leavitt`，可以之后手动重命名
>
> `--name`和`-it`可以一起使用

给容器重命名：

```bash
docker rename <旧容器名或ID> <新容器名>
```

> **为了简便，ID可以只输前四位，下同**

查看运行中的容器：

```bash
docker ps
```

查看所有容器（运行的和停止的）：

```bash
docker ps -a
```

启动一个已有的容器：

```bash
docker start <容器名>
```

强制启动容器：

```bash
docker restart <容器名>
```

> | 命令             | 行为                                                         |
> | ---------------- | ------------------------------------------------------------ |
> | `docker start`   | **启动一个已停止的容器**，不重启运行中的                     |
> | `docker restart` | **无论是否在运行，都强制重启容器**（对于运行中的先 stop 再 start） |

停止容器：

```bash
docker stop <容器名>
```

删除容器：

```bash
docker rm 容器名
```

> 注意和删除镜像的`docker rmi`区别开

非交互式启动后手动进入/退出容器（两种方法）：

```bash
docker exec -it <容器名 或 ID> <要在容器内启动的可执行程序>
```

> 通常为`docker exec -it /bin/bash`， 其中`/bin/bash`为ubuntu里在终端输入命令、运行脚本时的解释器
>
> 运行后会在容器中新建一个终端来接受指令
>
> Ctrl+D 或输入`exit`退出，由于是新建终端，退出的只是这个终端，容器不会关闭，需要另外`stop`来停止容器

```bash
docker attach <容器名 或 ID>
```

> 运行后会直接为我们**接入容器主进程的已有终端**，之后就在此输入、运行命令行，而非新建终端来输入、运行命令行
>
> Ctrl+C 或输入`exit`退出，会连同容器一起

显示当前位置的绝对路径：

```bash
pwd
```

从容器复制文件至主机：

```bash
docker cp <容器ID>:待复制文件或文件夹的绝对路径 要复制到的目的地的绝对路径
```

> 如果显示mkdir 的permission denied 的话就加sudo
